
#include <stdio.h>


#include<locale.h>
int main()
{
    
	setlocale(LC_ALL, "RUS");
	/*
	//задание 1

	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);

	printf("При умножении %d на %d получится %d\n", 2000, 5, 2000*5);

	printf("%e разделить %e равно %e\n ", 5., 2., 5. / 2.);*/
	// при f 5,000000 разделить 2,000000 равно 2,500000; 
	// при g 5 разделить 2 равно 2,5
	// при d 0 разделить 0 равно 0
	// при e 5,000000e+00 разделить 2,000000e+00 равно 2,500000e+00

	//задание 2
	/*int N = 20, K = 20;

	printf("Сейчас %d часов %d минут 00 секунд\n\n", N, K);

	printf("Идет %d минута суток\n\n", N * 60 + K);

	printf("До полуночи осталось %d часа и %d минут\n\n", 23 - N, 60 - K);

	printf("С 8.00 прошло %d секунд\n\n", (N - 8)*3600+K*60);

	printf("Текущий час  = %f суток  и текущая минута = %f часа\n\n", N / 24., K / 60.);

	getchar(); */

	
	//задание 3
	int n = 2, L = 333, k = 3, m = 1;

	printf("Дано:\n%6d\n%6d\nОтвет:\n %-f\n", 2 ,333, 2./333);

}

