#include<stdio.h>

#include<locale.h>

int main() {



	setlocale(LC_ALL, "Rus");

	puts("\t\t\t\t******************************************\n\t\t\t\t*Тема: Разработка консольного приложения.*");

	puts("\t\t\t\t*Выполнил:Васильев Денис Алексеевич.\t*\n\t\t\t\t******************************************");



	puts("__   __     __   __  __       ");
	puts("  | |    /|   |  | ||         ");
	puts(" -- --    |  --  | | --       ");
	puts("|     |   | |    | |   |      ");
	puts(" -- --  . |  --. --  -- .     ");

}





